var tasks = [
    'Моделювати операцію додавання +',
    'Моделювати операцію відношення <',
    'Моделювати операцію відношення >',
    'Моделювати операцію відношення ==',
    'Моделювати операцію відношення <=',
    'Моделювати операцію відношення >=',
    'Моделювати операцію відношення !=',
    'Моделювати операцію модуля числа',
    'Моделювати операцію циклічного зсуву вліво <<',
    'Моделювати операцію циклічного зсуву вправо >>',
    'Моделювати операцію декременту (лічильник зменшення на 1)',
    'Визначити, яких бітів (0 чи 1) більше в його двійковому поданні',
    'Визначити кількість 0 і 1 бітів в двійковому поданні числа',
    'Визначити кількість нульових бітів після одиничного молодшого біту числа',
    '',
];

var variant_id = parseInt($var);

tasks[variant_id % tasks.length];