<%
    var tasks = [
	'Якщо кількість десяткових цифр у строці більша 5 вивести 1 інакше - 0.                                             ',
	'Якщо кількість буквенних символів у строці більша 5 вивести 1 інакше - 0.                                          ',
	'Перший з символів, що повторюється більше 1 раза підряд, інакше 0.                                                 ',
	'Останній з символів, що повторюється більше 1 раза підряд, інакше 0.                                               ',
	'Символ, що слідує за останнім символом ‘@’, якщо такого нема - вивести 0.                                          ',
	'Кількість шістнадцяткових символів у строці.                                                                       ',
	'Кількість пустих символів у строці.                                                                                ',
	'Кількість приголосних букв у строці.                                                                               ',
	'Суму кодів першого і останнього непустих символів строки.                                                          ',
	'Різницю кодів першого і останнього непустих символів строки.                                                       ',
	'Суму значень, яким відповідають перший і останній десятковий цифровий символи строки.                              ',
	'Різницю значень, яким відповідають перший і останній десятковий цифровий символи строки.                           ',
	'Добуток значень, яким відповідають перший і останній десятковий цифровий символи строки.                           ',
	'Менше зі значень, яким відповідають перший і останній шістнадцятковий цифровий символи строки.                     ',
	'Більше зі значень, яким відповідають перший і останній шістнадцятковий цифровий символи строки.                    ',
	'Останній символ десяткової цифри, або символ ‘0’ якщо такого немає.                                                ',
	'Останній символ шістнадцяткової цифри, або символ ‘0’ якщо такого немає.                                           ',
	'Кількість голосних букв у строці.                                                                                  ',
	'Кількість знаків пунктуації у строці.                                                                              ',
	'Якщо кількість відкриваючих круглих дужок у строці рівна кількості закриваючих круглих дужок - вивести 1, інакше 0.',
	'Кількість цифрових і буквенних символів у строці.                                                                  ',
	'Символ з найменшим кодом у таблиці ASCII.                                                                          ',
	'Символ з найбільшим кодом у таблиці ASCII.                                                                         ',
	'Останній символ у верхньому регістрі, або символ ‘0’ якщо такого немає.                                            ',
	'Останній символ у нижньому регістрі, або символ ‘0’ якщо такого немає.                                             '
];
    var task = tasks[parseInt($var) % tasks.length];
%>

### Recursive Functions

Виконати завдання за допомогою рекурсивних функцій (без використання циклів): 

Користувач вводить строку. Обчислити і вивести <%= task %> у консоль.

Матеріали:
1. [Декілька простих прикладів як створювати рекурсивні функції](https://docs.google.com/document/d/1daRe7hpSrKf6rsr9xQv7U1KVMASuFiF_tYFppHh-G2o/edit?usp=sharing)
2. [Лекція 4. Стек викликів функцій. Рекурсія](https://docs.google.com/document/d/1pl0YIU1rx3WcaX3mQT8aLKy1DVHHzuD5aWxnmVRnv5w/edit?usp=sharing)